name: "PCN-3"

layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: false
  }
  data_param {
    source: "/home/shay/yaw_db/train/lmdb/"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
  }
  data_param {
    source: "/home/shay/yaw_db/test/lmdb/"
    batch_size: 16
    backend: LMDB
  }
}

layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "data"
  top: "conv1_3"
  input_param { shape: { dim: 1 dim: 3 dim: 48 dim: 48 } }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 3
  }
}
layer {
  name: "pool1_3"
  type: "Pooling"
  bottom: "conv1_3"
  top: "pool1_3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu1_3"
  type: "ReLU"
  bottom: "pool1_3"
  top: "pool1_3"
}
layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "pool1_3"
  top: "conv2_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 3
  }
}
layer {
  name: "pool2_3"
  type: "Pooling"
  bottom: "conv2_3"
  top: "pool2_3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "relu2_3"
  type: "ReLU"
  bottom: "pool2_3"
  top: "pool2_3"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "pool2_3"
  top: "conv3_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 3
  }
}
layer {
  name: "pool3_3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3_3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "pool3_3"
  top: "pool3_3"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "pool3_3"
  top: "conv4_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  convolution_param {
    num_output: 144
    kernel_size: 2
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "fc5_3"
  type: "InnerProduct"
  bottom: "conv4_3"
  top: "fc5_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  inner_product_param {
    num_output: 192
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "fc5_3"
  top: "fc5_3"
}
layer {
  name: "fc6_3"
  type: "InnerProduct"
  bottom: "fc5_3"
  top: "fc6_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  inner_product_param {
    num_output: 2
  }
}
layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "fc6_3"
  top: "cls_prob"
}
layer {
  name: "bbox_reg_3"
  type: "InnerProduct"
  bottom: "fc5_3"
  top: "bbox_reg_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  inner_product_param {
    num_output: 3
  }
}
layer {
  name: "rotate_reg_3"
  type: "InnerProduct"
  bottom: "fc5_3"
  top: "rotate_reg_3"
  param {
	lr_mult: 0
	decay_mult: 0
  }
  param {
	lr_mult: 0
	decay_mult: 0
  }
  inner_product_param {
    num_output: 1
  }
}
layer {
  name: "yaw_reg_3"
  type: "InnerProduct"
  bottom: "fc5_3"
  top: "yaw_reg_3"
  inner_product_param {
    num_output: 1
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "yaw_reg_3"
  bottom: "label"
  top: "loss"
}
